---
kind: method
id: M:Autodesk.Revit.DB.ViewShapeBuilder.#ctor
source: html/6fac7545-5f28-8bcf-ec2b-ad38ba11f36a.htm
---
# Autodesk.Revit.DB.ViewShapeBuilder.#ctor Method

Default constructor for an ViewShapeBuilder object.

## Syntax (C#)
```csharp
public ViewShapeBuilder()
```